Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t
Serialization structure for Fitting and CutPlane.

Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t.Boolean
Boolean is the base class for operation. It defines e.g. the father part of the operation.

Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t.Plane
The plane.

Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t.Type
Type of the operation.
Options are:
FITTING
CUTPLANE